/*****************************************************************
 ** 文件名:  main.c
 ** 2020-2022 珠海禾田电子科技有限公司 Co.Ltd
 
 ** 创建人: 骆军城
 ** 日  期: 2022-01
 ** 描  述: 主函数文件
 ** 版  本: V1.0

 ** 修改人:
 ** 日  期:
 ** 修改描述:
 ** 版  本: 
******************************************************************/

/*****************************************************************
* 包含头文件
******************************************************************/

#include <stdio.h>

#include "hidusb.h"


/*****************************************************************
* 宏定义(仅在当前C文件使用的宏定义写在当前C文件中，否则需写在H文件中)
******************************************************************/
//设备的标识号
#define HT232_USB_VID 			0x5548
#define HT232_USB_PID 			0x6666

//这个需要看设备所使用的ep
#define HT232_USB_HID_EPOUT		0x01
#define HT232_USB_HID_EPIN		0x81


/*****************************************************************
* 结构定义(仅在当前C文件使用的结构体写在当前C文件中，否则需写在H文件中)
******************************************************************/

/*****************************************************************
* 全局变量定义
******************************************************************/

/*****************************************************************
* 静态变量定义
******************************************************************/

/*****************************************************************
* 外部变量声明（如果全局变量没有在其它的H文件声明，引用时需在此处声明，
*如果已在其它H文件声明，则只需包含此H文件即可）
******************************************************************/

/*****************************************************************
* 函数原型声明
******************************************************************/

/*****************************************************************
* 函数定义
*注意，编写函数需首先定义所有的局部变量等，不允许在
*函数的中间出现新的变量的定义。
******************************************************************/


/*************************************************
** Function：	main
** Description: 主函数
** Input:	none
** Output：	none

** Return:	none
** Author：骆军城
** Date：2022-01-25

** Modification History：
** Author：
** Date：
** Description：
*************************************************/

int main(void)
{
	int ni = 0;
	int nRet = -1;
	uint8_t ucSndBuf[256] = {0};
	uint8_t ucRcvBuf[256] = {0};
	uint8_t ucSndLen = 0;
	uint8_t ucRcvLen = 0;

	libusb_device_handle *dev_handle = NULL;

	nRet =  hidUSB_Init();
	if(nRet != 0)
	{
		perror("hidUSB_Init failed\r\n");
		return -1;
	}


	nRet = hidUSB_open(&dev_handle, HT232_USB_VID, HT232_USB_PID);
	if(nRet != 0)
	{
		perror("hidUSB_open failed\r\n");
		return -1;
	}



	while(1)
	{
		ucSndBuf[0] = 0x8f;
		ucSndBuf[1] = 0x01;
		ucSndBuf[2] = 0x00;
		ucSndBuf[3] = 0x00;
		ucSndLen = 4;
		
		nRet =  hidUSB_write(dev_handle, HT232_USB_HID_EPOUT, ucSndBuf, ucSndLen, 1000);
		if(nRet == 0)
		{
			perror("hidUSB_write failed\r\n");
			goto iSleep;
		}

		ucRcvLen =  hidUSB_read(dev_handle, HT232_USB_HID_EPIN, ucRcvBuf, sizeof(ucRcvBuf), 1000);
		if(ucRcvLen == 0)
		{
			perror("hidUSB_read failed\r\n");
			goto iSleep;
		}

		for(ni=0; ni<ucRcvLen; ni++)
		{
			printf("%02X ", ucRcvBuf[ni]);
		}
		
		printf("\r\n");
iSleep:
		sleep(1);
	}

	nRet = hidUSB_close(dev_handle);
	if(nRet != 0)
	{
		perror("hidUSB_open failed\r\n");
	}


	hidUSB_DeInit();

	return 0;
}

